Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: This may not be a URL for non-standard bundle formats or for some older bundle formats.
ja: これは、非標準バンドル形式に対するまたはいくつかのより古いバンドル形式に対するURLでないかもしれません。

source: This may not be a path for non-standard bundle formats or for some older bundle formats.
ja: これは、非標準バンドル形式に対するまたはいくつかのより古いバンドル形式に対するパスではかもしれません。

source: This may result in a date which is backward than the given date, of course.
ja: これは、もちろん、与えられた日付より過去にさかのぼった日付という結果になるかもしれません。

source: This may result in the immediate sending of the reply event to the sender of the suspended event, if the sender has requested a reply.
ja: これは、休止イベントの送り手に即座に返答イベントを送る結果となるでしょう、送り手が返答を要求するならば。

source: This means that the file handle object both creates the file descriptor and is responsible for closing it later, usually when the file handle object itself is deallocated.
ja: これはファイルハンドルオブジェクトが、ファイル記述子を作成してそしてそれを後で閉じること、ふつうはファイルハンドルオブジェクト自体がデアロケートされる時に、の両方に責任を持つのを意味します。

source: This method accepts the cookie only if the receiver’s cookie accept policy is NSHTTPCookie Accept Policy Always or NSHTTPCookie Accept Policy Only From Main Document Domain.
ja: このメソッドは、レシーバの持つクッキー受入方針がNSHTTPCookie Accept Policy AlwaysまたはNSHTTPCookie Accept Policy Only From Main Document Domainである場合にのみ、クッキーを受け入れます。

source: This method accommodates Apple’s naming conventions for high-resolution versions of the image.
ja: このメソッドは、画像のハイレゾリューション版のためのApple命名規則に対応します。

source: This method allows you to dynamically provide an implementation for a given selector.
ja: このメソッドは、あなたに指定されたセレクタに対する実装を動的に提供させます。

source: This method also does not return URLs for the current directory (“.”), parent directory (“..”), or resource forks (files that begin with “._”) but it does return other hidden files (files that begin with a period character).
ja: このメソッドはまた、現在のディレクトリ（“.”）、親ディレクトリ（“..”）、またはリソークフォーク（“._” で始まるファイル）のURLを返しません、しかしそれは他の不可視ファイルを返します（１つのピリオド文字で始まるファイル）。

source: This method also does not return URLs for the current directory (“.”), parent directory (“..”), or resource forks (files that begin with “._”) but it does return other hidden files.
ja: このメソッドはまた、現在のディレクトリ（“.”）、親ディレクトリ（“..”）、またはリソークフォーク（“._” で始まるファイル）のURLを返しません、しかしそれは他の不可視ファイルを返します。

source: This method also fails if any of the intermediate path elements corresponds to a file and not a directory.
ja: このメソッドはまた、中間にあるパス要素のどれかがファイルに相当するかディレクトリでないならば失敗します。

source: This method also returns nil if the bundle specified by the bundle Path parameter does not exist or is not a readable directory.
ja: このメソッドはまた、bundle Pathパラメータによって指定されたバンドルが存在しないまたは読み出し可能なディレクトリでないならばnilを返します。

source: This method also returns false if a file, directory, or link already exists at dst Path.
ja: このメソッドはまたfalseを、ファイル、ディレクトリ、またはリンクが既にdst Pathで存在するならば返します。

source: This method also returns false if a file, directory, or link already exists at dst URL.
ja: このメソッドはまたfalseを、ファイル、ディレクトリ、またはリンクが既にdst URLで存在するならば返します。

source: This method also returns false if a file, directory, or link already exists at path.
ja: このメソッドはまたfalseを、もしファイル、ディレクトリ、またはリンクが既にpathで存在するならば返します。

source: This method also returns false if a file, directory, or link already exists at url.
ja: このメソッドはまたfalseを、もしファイル、ディレクトリ、またはリンクが既にurlで存在するならば返します。

source: This method also returns false if no item exists at url.
ja: このメソッドはまたfalseを、項目がurlで存在しないならば返します。

source: This method also throws an exception if the conversion of the string fails.
ja: このメソッドはまた、文字列の変換が失敗するならば、例外をスローします。

source: This method also uses the real user ID and group ID, as opposed to the effective user and group IDs, to determine if the file is executable.
ja: このメソッドはまた、実ユーザIDおよびグループIDを使うことで、実効ユーザおよびグループIDではなく、ファイルが実行可能であるかを決定します。

source: This method also uses the real user ID and group ID, as opposed to the effective user and group IDs, to determine if the file is readable.
ja: このメソッドはまた、実ユーザIDおよびグループIDを使うことで、実効ユーザおよびグループIDではなく、ファイルが読み出し可能であるかを決定します。

source: This method also uses the real user ID and group ID, as opposed to the effective user and group IDs, to determine if the file is writable.
ja: このメソッドはまた、実ユーザIDおよびグループIDを使うことで、実効ユーザおよびグループIDではなく、ファイルが書き込み可能であるかを決定します。

source: This method always returns the same file manager object.
ja: このメソッドは、常に同じファイルマネージャオブジェクトを返します。

source: This method applies the current rotation and scaling factors to a Size; it does not apply translation factors.
ja: このメソッドは、現在の回転と拡大縮小因数をa Sizeに適用します；それは変換因数に適用されません。

source: This method assumes an unscaled and unrotated coordinate system.
ja: このメソッドは、非縮尺および非回転の座標システムを仮定されます。

source: This method asynchronously creates a file handle for the other end of the socket connection and returns that object by posting a NSFile Handle Connection Accepted notification in the current thread.
ja: このメソッドは、ソケット接続の他方の終端に対するファイルハンドルを非同期に作成します、そしてそのオブジェクトをNSFile Handle Connection Accepted通知を現在のスレッドにおいて投函することによって返します。

source: This method attempts to unload a bundle’s executable code using the underlying dynamic loader (typically dyld).
ja: このメソッドは、バンドルの実行可能コードを、基礎をなす動的ローダー（一般的にdyld）を使ってアンロードしようと試みます。

source: This method calculates the elapsed time between the start Date and end Date values and uses that information to generate the string.
ja: このメソッドは、start Dateとend Date値の間の経過時間を計算します、そしてその情報を使って文字列を生成します。

source: This method calls add Observer(_: selector: name: object: suspension Behavior:), passing coalesce for suspension Behavior.
ja: このメソッドは、add Observer(_: selector: name: object: suspension Behavior:)を呼び出します、coalesceをsuspension Behaviorに渡します。

source: This method calls for Type(_:) with an argument of NSLocal Notification Center Type.
ja: このメソッドは、for Type(_:)をNSLocal Notification Center Typeの引数とともに呼び出します。

source: This method can be used to hide an NSDiscardable Content object's content volatility by creating an object that responds to the same messages but holds the contents of the original receiver available as long as the created proxy lives.
ja: このメソッドは、NSDiscardable Contentオブジェクトの持つ内容の揮発性を同じメッセージに応答するオブジェクトの作成によって隠して、しかし作成されたプロキシが生きている間はオリジナルのレシーバの内容を利用可能に保持するという目的に利用可能です。

source: This method can take throwing closure.
ja: このメソッドは、スローを行うクロージャをとることができます。

source: This method changes the current working directory for the current process, not just the receiver.
ja: このメソッドは、単にレシーバではなく、現在のプロセスに対する現在の作業ディレクトリを変更します。

source: This method converts the provided value in joules into units appropriate to the formatter’s locale.
ja: このメソッドは、ジュールで与えられた値をフォーマッタの持つロケールにふさわしい単位に変換します。

source: This method creates a new thread in your application, putting your application into multithreaded mode if it was not already.
ja: このメソッドは、新しいスレッドをあなたのアプリケーションにおいて作成します、あなたのアプリケーションを、それがまだそうでなかったならば、あなたのアプリケーションをマルチスレッドモードにします。

source: This method creates a snapshot of the specified flat file and places that copy in a temporary iCloud location where it can be accessed by other users using the returned URL.
ja: このメソッドは、指定されたフラットファイルのスナップショットを作成します、そしてそのコピーを一時iCloud記憶場所に置きます、そこにおいてそれは返されるURLを使っている他のユーザによってアクセス可能です。

source: This method creates and returns a new NSBundle object if there is no existing bundle associated with identifier.
ja: このメソッドは、identifierと一致する既存のバンドルが存在しないならば、新しいNSBundleオブジェクトを作成して返します。

source: This method determines conformance solely on the basis of the formal declarations in header files, as illustrated above.
ja: このメソッドは、ただ単にヘッダファイル中の形の上での宣言に基づいて準拠を、上で説明されるように、判定します。

source: This method differs from wait For Data In Background And Notify() in that modes specifies the run-loop mode (or modes) in which NSFile Handle Data Available can be posted.
ja: このメソッドは、wait For Data In Background And Notify()とは、modesがそこにおいてNSFile Handle Data Availableが投函されることが可能な実行ループモード（または複数のモード）を指定することにおいて異なります。

source: This method differs from read In Background And Notify() in that modes specifies the run-loop mode (or modes) in which read Completion Notification can be posted.
ja: このメソッドは、read In Background And Notify()とは、modesがそこにおいてread Completion Notificationが投函されることが可能な実行ループモード（または複数のモード）を指定することにおいて異なります。

source: This method differs from accept Connection In Background And Notify() in that modes specifies the run-loop mode (or modes) in which NSFile Handle Connection Accepted can be posted.
ja: このメソッドは、accept Connection In Background And Notify()とは、modesがそこにおいてNSFile Handle Connection Acceptedが投函されることが可能な実行ループモード（または複数のモード）を指定することにおいて異なります。

source: This method does not cache its search results.
ja: このメソッドは、それの検索結果をキャッシュしません。

source: This method does not look up images based on set Name(_:) or get named system images.
ja: このメソッドは、set Name(_:)に基づく画像の検索や、名前付システム画像の取得を行いません。

source: This method does not reflect whether the file has actually been uploaded to any iCloud servers.
ja: このメソッドは、ファイルが実際に何らかのiCloudサーバにアップロードされたかどうかを反映しません。

source: This method does not remove the item from the cloud.
ja: このメソッドは、クラウドから項目を除去しません。

source: This method does not resolve symbolic links encountered in the traversal process, nor does it recurse through them if they point to a directory.
ja: このメソッドは、辿っていく過程において列挙されるシンボリックリンクそれらを解決しませんし、それらがディレクトリを指すならそれらを通して再帰もしません

source: This method does not traverse a terminal symbolic link.
ja: このメソッドは、ターミナルシンボリックリンクを辿りません。

source: This method does not traverse symbolic links contained in dest Path, making it possible to create symbolic links to locations that do not yet exist.
ja: このメソッドは、dest Pathの中に含まれるシンボリックリンクを辿らず、まだ存在しない場所に対するシンボリックリンクを作成することを可能にします。

source: This method does not traverse symbolic links contained in dest URL, making it possible to create symbolic links to locations that do not yet exist.
ja: このメソッドは、dest URLの中に含まれるシンボリックリンクを辿らず、まだ存在しない場所に対するシンボリックリンクを作成することを可能にします。

source: This method does not traverse symbolic links, but compares the links themselves.
ja: このメソッドはシンボリックリンクを辿りません、しかしリンクそれ自体は比較します。

source: This method does not verify that the contents at pointer have enough space to hold count bytes.
ja: このメソッドは、ポインタでの内容がcountバイトを保持するために十分な空間を持つことを検証しません。

source: This method does not verify that the contents at pointer have enough space to hold the required number of bytes.
ja: このメソッドは、ポインタでの内容が要求されたバイト数を保持するために十分な空間を持つことを検証しません。

source: This method doesn't return all localizations in order of user preference.
ja: このメソッドは、すべてのローカライゼーションをユーザ環境設定の順番で返すことはしません。

source: This method executes synchronously.
ja: このメソッドは同期的に実行されます。

source: This method exists for historical reasons; memory zones are no longer used by Objective-C.
ja: このメソッドは歴史的理由から存在します；メモリゾーンはもはやObjective-Cによって使われません。

source: This method formats the specified number of seconds into the appropriate units.
ja: このメソッドは、指定された秒数を適切な単位へと書式設定します。

source: This method gives an object a chance to redirect an unknown message sent to it before the much more expensive forward Invocation: machinery takes over.
ja: このメソッドは、あるオブジェクトに対してそれに送られた未知のメッセージを転送する機会を、ずっと高くつくforward Invocation:の仕掛けが引き継ぐ前に与えます。

source: This method has the effect of removing the specified range of elements from the collection and inserting the new elements at the same location.
ja: このメソッドは、指定された範囲の要素をコレクションから取り除き、そして新しい要素を同じ場所に挿入する効果を持ちます。

source: This method has the same behavior as the object(at:) method.
ja: このメソッドはobject(at:)と同じ挙動を持ちます。

source: This method has the same behavior as the string(from:) method.
ja: このメソッドは、string(from:)メソッドと同じ挙動を持ちます。

source: This method ignores irrelevant header fields in header Fields, allowing dictionaries to contain additional data.
ja: このメソッドは、header Fieldsにおいて無関係なヘッダフィールドを無視して、辞書が追加的なデータを含むことを可能にします。

source: This method implements the mathematical notion of lexicographical ordering, which has no connection to Unicode.
ja: このメソッドは、語彙筆記的順序の数学的概念を実装します、それはユニコードに関係はありません。

source: This method initializes and returns a new instance only if there is no existing bundle associated with url, otherwise it deallocates self and returns the existing object.
ja: このメソッドは、urlと関連付けられるバンドルが存在しない場合にのみ新しいインスタンスを初期化して返します、そうでなければそれはselfをデアロケートして既存のオブジェクトを返します。

source: This method initializes and returns a new instance only if there is no existing bundle associated with full Path, otherwise it deallocates self and returns the existing object.
ja: このメソッドは、full Pathと関連付けられるバンドルが存在しない場合にのみ新しいインスタンスを初期化して返します、そうでなければそれはselfをデアロケートして既存のオブジェクトを返します。

source: This method invokes post Notification Name(_: object: user Info: deliver Immediately:) with deliver Immediately: NO.
ja: このメソッドは、post Notification Name(_: object: user Info: deliver Immediately:)をdeliver Immediately: NOとともに発動します。

source: This method invokes post Notification Name(_: object: user Info: deliver Immediately:) with user Info: nil deliver Immediately: NO.
ja: このメソッドは、post Notification Name(_: object: user Info: deliver Immediately:)をuser Info: nil deliver Immediately: NOとともに発動します。

source: This method invokes read Data(of Length:) as part of its implementation.
ja: このメソッドは、read Data(of Length:)をそれの実装の一部として発動します。

source: This method is a compatibility method.
ja: このメソッドは、互換メソッドです。

source: This method is a designated initializer for NSApple Script.
ja: このメソッドは、NSApple Scriptの指定イニシャライザです。

source: This method is a designated initializer.
ja: このメソッドは、指定イニシャライザです。

source: This method is best suited only for the occasional retrieval of resource files.
ja: このメソッドは、リソースファイルのときたまの検索に限って最適なものです。

source: This method is called before the Objective-C forwarding mechanism is invoked.
ja: このメソッドは、Objective-Cの転送メカニズムが発動される前に呼び出されます。

source: This method is called once for each item that needs to be copied.
ja: このメソッドは、コピーされることが必要な各項目に対して一度だけ呼び出されます。

source: This method is called only once for the item being moved, regardless of whether the item is a file, directory, or symbolic link.
ja: このメソッドは、項目が移動されることに対して一度だけ呼び出されます、項目がファイル、ディレクトリ、またはシンボリックリンクであるかに関係なく。

source: This method is declared in NSHelp Manager .h.
ja: このメソッドは、NSHelp Manager .hにおいて宣言されます。

source: This method is identical to skip Descendents() except for the spelling.
ja: このメソッドは、skip Descendents()と、綴りを除いては同一です。

source: This method is implemented as a & (bitwise AND) operation on the two sets’ raw values.
ja: このメソッドは、２つの集合の持つ生の値に関する&（ビット単位AND）演算として実装されます。

source: This method is implemented as a ^ (bitwise XOR) operation on the two sets’ raw values.
ja: このメソッドは、２つの集合の持つ生の値に関する^（ビット単位XOR）演算として実装されます。

source: This method is implemented as a | (bitwise OR) operation on the two sets’ raw values.
ja: このメソッドは、２つの集合の持つ生の値に関する|（ビット単位OR）演算として実装されます。

source: This method is intended to locate known and common directories in the system.
ja: このメソッドは、システムにおいて既知の一般的なディレクトリの位置を突き止めることを意図されます。

source: This method is invoked by NSArchiver.
ja: このメソッドは、NSArchiverによって発動されます。

source: This method is invoked by NSCoder.
ja: このメソッドは、NSCoderによって発動されます。

source: This method is invoked each time the user presses a key while the cell has the keyboard focus—it lets you verify and edit the cell text as the user types it.
ja: このメソッドは、セルがキーボードフォーカスを持つ間は、ユーザがキーを押すたびに発動されます — それはあなたにセルテキストを、ユーザがそれをタイプするにつれて検証および編集させます。

source: This method is invoked on the prospective container of the copied object or objects.
ja: このメソッドは、コピーされたオブジェクトまたは複数のオブジェクトの予想されるコンテナ上で発動されます。

source: This method is invoked on the prospective container of the new object.
ja: このメソッドは、新しいオブジェクトの予想されるコンテナ上で発動されます。

source: This method is not appropriate for use on Date Components values which are specifying relative quantities of calendar components.
ja: このメソッドは、カレンダー構成要素の相対量を指定する、Date Components値上で使うには適しません。

source: This method is not supported for the NSEnergy Formatter class.
ja: このメソッドは、NSEnergy Formatterクラスに対してサポートされません。

source: This method is preferred over reduce(_: _:) for efficiency when the result is a copy-on-write type, for example an Array or a Dictionary.
ja: このメソッドは、効率のためにreduce(_: _:)より好まれます、その結果がコピーオンライト型である場合、例えばArrayまたは辞書に対しては。

source: This method is primarily intended for Cocoa’s internal use.
ja: このメソッドは、もっぱらCocoaの内部利用を意図されます。

source: This method is similar to sorted Array(_: context:), except that it uses the supplied hint to speed the sorting process.
ja: このメソッドはsorted Array(_: context:)に似ていますが、それがソート処理をはかどらせるために提供されるヒントを使うところが違います。

source: This method is the fundamental matching method for regular expressions and is suitable for overriding by subclassers.
ja: このメソッドは、基本的なマッチング・メソッドであって、サブクラスによってオーバーライドするのに適したものです。

source: This method is typically used by frameworks and plug-ins to locate their own bundle at runtime.
ja: このメソッドは、一般的にフレームワークとプラグインによって使われて、それら自身のバンドルを実行時に捜し出します。

source: This method is useful for creating a character set object with data from a file or other external data source.
ja: このメソッドは、ファイルまたは他の外部データ源からのデータで文字集合オブジェクトを作成するのに役立ちます。

source: This method is useful for preserving the capacity of table.
ja: このメソッドは、tableの収容能力を保全するのに役立ちます。

source: This method is useful for transforming delta or distance values when you need to take scaling and rotation factors into account.
ja: このメソッドは、あなたが拡大縮小や回転の要素を考慮に入れる必要がある時に、変換している増分や隔たりの値として役立ちます。

source: This method makes it easier to find the plane containing the members of the current character set.
ja: このメソッドは、現在の文字集合のメンバーを含んでいる面を見つけるのを容易にします。

source: This method may be somewhat more efficient than trying to locate the bundle using the init(for:) method.
ja: このメソッドは、バンドルを捜し出すのにinit(for:)メソッドを使うより、ある程度まではより効率的かもしれません。

source: This method may not return a URL for non-standard bundle formats or for some older bundle formats.
ja: これは、非標準バンドル形式に対するまたはいくつかのより古いバンドル形式に対するURLを返さないかもしれません。

source: This method may not return a path for non-standard bundle formats or for some older bundle formats.
ja: これは、非標準バンドル形式に対するまたはいくつかのより古いバンドル形式に対するパスを返さないかもしれません。

source: This method may return nil if the file wrapper is a child created when its parent was read from the file system, and the child was modified before it was read.
ja: このメソッドはnilを返すかもしれません、もしファイルラッパーが子で、それの親がファイルシステムから読み出された時に作成される、そして子がそれが読み出されるより前に修正されたならば。

source: This method may return a valid bundle object even for unbundled apps.
ja: このメソッドは、バンドルされないアプリに対してさえ有効なバンドルオブジェクトを返すかもしれません。

source: This method might successfully return an object, an array of objects, or nil, depending on the kind of object specifier.
ja: このメソッドは、オブジェクト指定子の種類に依存して、成功裏にあるオブジェクト、複数オブジェクトの配列、またはnilを返すかもしれません。

source: This method multiplies the matrix in a Transform by the receiver’s matrix and replaces the receiver’s matrix with the result.
ja: このメソッドは、a Transformの行列をレシーバの行列と掛け算して、レシーバの行列をその結果で置き換えます。

source: This method multiplies the receiver's matrix by the matrix in a Transform and replaces the receiver's matrix with the results.
ja: このメソッドは、レシーバの行列をa Transformの行列と掛け算して、レシーバの行列をその結果で置き換えます。

source: This method only returns an NSString when sent to the the current() instance, all other instances currently return nil.
ja: このメソッドがNSStringを返すのは、current()インスタンスを送った場合だけです、全ての他のインスタンスは現在nilを返します。

source: This method overrides the results of the decoder’s class and instance name to class encoding tables.
ja: このメソッドはデコーダのクラスとクラスエンコーディングテーブルに対するインスタンス名をオーバーライドします。

source: This method performs a coordinated write operation on the specified file, which can block for a long time.
ja: このメソッドは、指定されたファイル上で協調書き込み演算を実行します、それは長時間封鎖する可能性があります。

source: This method performs a shallow search of the directory and therefore does not traverse symbolic links or return the contents of any subdirectories.
ja: このメソッドは、ディレクトリの浅い検索を実行します、そしてそれゆえにシンボリックリンクを辿りません、またあらゆる下位ディレクトリの内容を返しません。

source: This method performs an asynchronous available Data operation on a file or communications channel and posts an read Completion Notification notification on the current thread when that operation is complete.
ja: このメソッドは、非同期available Data演算をファイルまたは通信経路上で実行します、そしてread Completion Notification通知を現在のスレッド上で、その演算が完了する場合に投函します。

source: This method performs an asynchronous read To End Of File operation on a file or communications channel and posts an NSFile Handle Read To End Of File Completion.
ja: このメソッドは、非同期read To End Of File演算をファイルまたは通信経路上で実行します、そしてNSFile Handle Read To End Of File Completionを投函します。

source: This method performs the same task as the file Manager(_: should Copy Item At: to:) method, which is preferred over this method in macOS 10.6 and later.
ja: このメソッドは、macOS 10.6以降ではこのメソッドより好まれるfile Manager(_: should Copy Item At: to:)メソッドと同じ業務を実行します。

source: This method performs the same task as the file Manager(_: should Copy Item At Path: to Path:) method and is preferred over that method in macOS 10.6 and later.
ja: このメソッドは、file Manager(_: should Copy Item At Path: to Path:)メソッドと同じ業務を実行して、そのメソッドより、macOS 10.6以降では好まれます。

source: This method performs the same task as the file Manager(_: should Link Item At: to:) method, which is preferred over this method in macOS 10.6 and later.
ja: このメソッドは、macOS 10.6以降ではこのメソッドより好まれるfile Manager(_: should Link Item At: to:)メソッドと同じ業務を実行します。

source: This method performs the same task as the file Manager(_: should Link Item At Path: to Path:) method and is preferred over that method in macOS 10.6 and later.
ja: このメソッドは、file Manager(_: should Link Item At Path: to Path:)メソッドと同じ業務を実行して、そのメソッドより、macOS 10.6以降では好まれます。

source: This method performs the same task as the file Manager(_: should Move Item At: to:) method, which is preferred over this method in macOS 10.6 and later.
ja: このメソッドは、macOS 10.6以降ではこのメソッドより好まれるfile Manager(_: should Move Item At: to:)メソッドと同じ業務を実行します。

source: This method performs the same task as the file Manager(_: should Move Item At Path: to Path:) method and is preferred over that method in macOS 10.6 and later.
ja: このメソッドは、file Manager(_: should Move Item At Path: to Path:)メソッドと同じ業務を実行して、そのメソッドより、macOS 10.6以降では好まれます。

source: This method performs the same task as the file Manager(_: should Proceed After Error: copying Item At: to:) method, which is preferred over this method in macOS 10.6 and later.
ja: このメソッドは、macOS 10.6以降ではこのメソッドより好まれるfile Manager(_: should Proceed After Error: copying Item At: to:)メソッドと同じ業務を実行します。

source: This method performs the same task as the file Manager(_: should Proceed After Error: copying Item At Path: to Path:) method and is preferred over that method in macOS 10.6 and later.
ja: このメソッドは、file Manager(_: should Proceed After Error: copying Item At Path: to Path:)メソッドと同じ業務を実行して、そのメソッドより、macOS 10.6以降では好まれます。

source: This method performs the same task as the file Manager(_: should Proceed After Error: linking Item At: to:) method, which is preferred over this method in macOS 10.6 and later.
ja: このメソッドは、macOS 10.6以降ではこのメソッドより好まれるfile Manager(_: should Proceed After Error: linking Item At: to:)メソッドと同じ業務を実行します。

source: This method performs the same task as the file Manager(_: should Proceed After Error: linking Item At Path: to Path:) method and is preferred over that method in macOS 10.6 and later.
ja: このメソッドは、file Manager(_: should Proceed After Error: linking Item At Path: to Path:)メソッドと同じ業務を実行して、そのメソッドより、macOS 10.6以降では好まれます。

source: This method performs the same task as the file Manager(_: should Proceed After Error: moving Item At: to:) method, which is preferred over this method in macOS 10.6 and later.
ja: このメソッドは、macOS 10.6以降ではこのメソッドより好まれるfile Manager(_: should Proceed After Error: moving Item At: to:)メソッドと同じ業務を実行します。

source: This method performs the same task as the file Manager(_: should Proceed After Error: moving Item At Path: to Path:) method and is preferred over that method in macOS 10.6 and later.
ja: このメソッドは、file Manager(_: should Proceed After Error: moving Item At Path: to Path:)メソッドと同じ業務を実行して、そのメソッドより、macOS 10.6以降では好まれます。

source: This method performs the same task as the file Manager(_: should Proceed After Error: removing Item At:) method, which is preferred over this method in macOS 10.6 and later.
ja: このメソッドは、macOS 10.6以降ではこのメソッドより好まれるfile Manager(_: should Proceed After Error: removing Item At:)メソッドと同じ業務を実行します。
